name: "VGG_cocoText_SSD_300x300_deploy"
layer {
  name: "data"
  type: "AnnotatedData"
  top: "data"
  top: "label"
  include {
    phase: TEST
  }
  transform_param {
    mean_value: 104
    mean_value: 117
    mean_value: 123
    resize_param {
    	prob: 1
	resize_mode: RESIZE_AND_PAD
	height: 640
	width: 640
	pad_mode: CONSTANT
    }
  }
  data_param {
    source: "/Users/marissac/data/coco/lmdb/coco_combo_val2014_final_lmdb"
    batch_size: 1
    backend: LMDB
  }
  annotated_data_param {
    batch_sampler {
    }
    label_map_file: "/Users/marissac/caffe/data/coco/labelmap_coco_combo.prototxt"
  }
}